Repository: zabbix-jp/translation
Catalog: releasenote/releasenote-omegat.tmx
Source language: en_us
Languages: ja

source: WEB interface speed and usability have been improved greatly.
ja: WEBインターフェースの速度とユーザビリティの大幅な改善

source: Improved View of Trigger Statuses
ja: トリガー状態の表示を改善

source: What's New in 1.5.4 (beta)
ja: ZABBIX 1.5.4 (beta)の変更点

source: [ZBX-526] fixed graphs on screens not getting refreshed issue
ja: [ZBX-526] スクリーンのグラフがリフレッシュされない問題を修正

source: User permissions schema differs from 1.4 for Admins and Super Admins
ja: ZABBIX管理者とZABBIX特権管理者のユーザ権限が変更されています。

source: [ZBX-1939] fixed errors when unicode chars are used in item keys
ja: [ZBX-1939] アイテムのキーでユニコード文字を使用する時に発生していたエラーを修正

source: [ZBX-1377] fixed adding template with linked template
ja: [ZBX-1377] テンプレートとリンクしたテンプレートの追加処理の問題を修正

source: The release does not introduce new functionality, it fixes all known issues of ZABBIX 1.1.5.
ja: このリリースはZABBIX 1.1.5のいくつかの問題の修正を行っており、新しい機能の追加は含まれません。

source: Thanks to Jakov Sosic
ja: Jakov Sosicに感謝

source: Disabling of login rights for a group of users
ja: ユーザグループのログイン権限無効設定

source: ZABBIX could retrieve data directly from an external database by executing a SQL request.
ja: SQLリクエストを実行することによって外部のデータベースから直接データを取得することができます。

source: added host name of deppended trigger
ja: 依存されるトリガーのホスト名を追加

source: [ZBX-3059] different titles for popup menu depending on data type
ja: [ZBX-3059] データ型によってポップアップメニューで異なるタイトルが表示される問題を修正

source: [ZBX-2438] fixed configuration of ssh2 on FreeBSD.
ja: [ZBX-2438] FreeBSDのssh2設定を修正。

source: [ZBX-3430] fixed disappeared hints for "SSH", "Telnet" and "Database Monitor" item types in item form
ja: [ZBX-3430] アイテム設定画面で"SSH"、"Telnet"、"データベースモニタ"のアイテム種別のヒントが表示されなかった問題を修正

source: This document contains the release notes for Zabbix 1.8.7.
ja: このドキュメントはZabbix 1.8.7のリリースノートを含みます。

source: [DEV-254] improved server side logging
ja: [DEV-254] サーバ側のロギングを改善

source: [ZBX-3166] fixed application updating in Template linking event.
ja: [ZBX-3166] テンプレートリンク時のアプリケーションの更新処理を修正。

source: fixed processing of MM in format of log timestamps
ja: ログタイムスタンプのフォーマットのMMの処理の修正

source: This document contains the release notes for Zabbix 1.8.6rc1.
ja: このドキュメントはZabbix 1.8.6rc1のリリースノートを含みます。

source: [ZBX-1763] applied patch with translation for some javascript strings
ja: [ZBX-1763] いくつかのjavaスクリプトの文字列の翻訳パッチを適用

source: [ZBX-182] fixed processing of icmpping if dns name cannot be resolved
ja: [ZBX-182] DNS名が解決できない場合のicmppingの処理を修正

source: New trigger functions
ja: 新しいトリガー関数

source: [ZBX-819] Error in import script
ja: [ZBX-819] インポートスクリプトのエラーを修正

source: [ZBX-389] added escaping in SQL statement in DBupdate_graph
ja: [ZBX-389] DBupdate_graphのSQLステートメントにエスケープ処理を追加

source: [ZBX-90] fixed displaying of last line of a log file in the Latest Data and Overview
ja: [ZBX-90] 最新データと概要画面のログファイルの最終行の表示を修正

source: [DEV-317] added new action conditions (node, discovery rule/check, proxy)
ja: [DEV-317] 新しいアクションのコンディション(ノード、ディスカバリルール/チェック、プロキシ)を追加

source: [ZBX-3103] updated French translation; thanks to Alixen
ja: [ZBX-3103] フランス語翻訳を更新; Alexenに感謝

source: User macros enhanced
ja: ユーザマクロの改善

source: [ZBX-1019] fixed stacked graph displays 0 value
ja: [ZBX-1019] 積算グラフの0の値の表示を修正

source: [ZBX-2378] renamed calculated item field 'Expression' to 'Formula', changed trigger option 'Multiple TRUE events' to use 'PROBLEM' instead
ja: [ZBX-2378] 計算アイテムのフィールド「Expression」を「Formula」に名前変更し、トリガーのオプション「Multiple TRUE events」を「Multiple PROBLEM events」に変更

source: [ZBX-3402] disabled "store value" overriding for host items inherited from templates
ja: [ZBX-3402] テンプレートから継承されたホストのアイテムの「保存時の計算」の上書きをを無効化

source: [ZBX-509] fixed problem with user rights to hostgroup without any host
ja: [ZBX-509] ホストが登録されていないホストグループのユーザ権限の問題を修正

source: [ZBX-4201] fixed template items included in bar reports
ja: [ZBX-4201] バーレポートでテンプレートのアイテムが含まれていた問題を修正

source: [ZBX-2274] fixed trigger expression corruption with trigger wizard
ja: [ZBX-2274] トリガーウィザードでトリガーの条件式が破損する問題を修正

source: [ZBX-1956] fixed deletion of last row or col in screen
ja: [ZBX-1956] スクリーンの最後の1行もしくは1列を削除できてしまう問題を修正

source: [ZBX-1625] when mass update hosts, default "connect to" option is set to IP
ja: [ZBX-1625] ホストの一括更新時に「接続方法」オプションのデフォルト値をIPに設定

source: See Zabbix Manualfor full details.
ja: 詳細はZabbixマニュアルを参照してください。

source: New set of map icons is available for creation of great looking maps.
ja: 新しいアイコンセットにより見栄えの良いマップを作成することができます。

source: [ZBX-1523] fixed last macros deletion
ja: [ZBX-1523] 最後に残ったマクロの削除処理を修正

source: Increased default max number of log file lines sent per second to 100
ja: 1秒間あたりに送付できるログファイルの最大行数のデフォルト値を100行に増加

source: [DEV-382] added support of IPv6 for monitoring of the SNMP devices
ja: [DEV-382] SNMPデバイスの監視にIPv6のサポートを追加

source: [ZBX-3378] updated Russian translation; thanks to dotneft and zalex_ua
ja: [ZBX-3378] ロシア語翻訳を更新; dotneftとzalex_uaに感謝

source: It is strongly recommended to upgrade from ZABIX 1.4.
ja: このリリースはZABIX 1.4からアップグレードすることを強く推奨します。

source: [ZBX-2888] fixed host profiles export
ja: [ZBX-2888] ホストのプロファイルのエクスポートを修正

source: [ZBX-891,ZBX-904] fixed time line update once now is selected
ja: [ZBX-891,ZBX-904] 現在の時刻が選択された時に一度タイムラインが更新される問題を修正

source: This document contains the release notes for Zabbix 1.8.9.
ja: このドキュメントはZabbix 1.8.9のリリースノートを含みます。

source: Thanks to Dan Horak.
ja: Dan Horak に感謝

source: [ZBX-2827] added checks when adding or updating maintenances, so that duplicate names could not be added
ja: [ZBX-2827] メンテナンス期間の追加や更新時のチェックを追加し、重複した名前が追加できないように修正

source: Support of negative values in graphs
ja: グラフがマイナス値をサポート

source: More Efficient ZABBIX Sender
ja: より効率的なZABBIX Sender

source: [ZBX-3649] fixed "frontends/php/styles/ie_default.css" doesn't exist (for IE6)
ja: [ZBX-3649] 「frontends/php/styles/ie_default.css」が存在しないというエラーを修正(IE6)

source: [DEV-358] added notification/trigger description macros {HOSTNAME[1..9]}
ja: [DEV-358] 通知用/トリガー名用マクロ{HOSTNAME[1..9]}を追加

source: The release does not introduce new functionality, it fixes all known issues of ZABBIX 1.1.2.
ja: このリリースはZABBIX 1.1.2のいくつかの問題の修正を行っており、新しい機能の追加は含まれません。

source: [ZBXNEXT-176] added zabbix server name input during setup
ja: [ZBXNEXT-176] セットアップにZabbixサーバ名の入力を追加

source: ZABBIX SIA is proud to announce the availability of Zabbbix 1.7.1 (alpha).
ja: ZABBIX SIAはZABBIX 1.7.1(alpha)のリリースをアナウンスすることを光栄に思います。

source: [ZBX-7] added support of system.cpu.util[] for FreeBSD agents, thanks to 'brick'
ja: [ZBX-7] FreeBSD用エージェントにアイテムsystem.cpu.util[]を追加。brickに感謝

source: New set of icons
ja: 新しいアイコンセット

source: [ZBX-114] fixed permissions for history of events
ja: [ZBX-114] イベント履歴の権限を修正

source: [ZBX-3516] fixed items and hosts disappearing from configuration cache indexes
ja: [ZBX-3516] 設定キャッシュのインデックスからアイテムとホストが消えてしまう問題を修正

source: [ZBX-4146] fixed page refreshing after adding new IT service
ja: [ZBX-4146] 新しいITサービスの追加後のページのリフレッシュを修正

source: [ZBX-2418] fixed bug with JavaScript URL parser, anchor was recognized as part of file
ja: [ZBX-2418] アンカーがファイルの一部として認識されるJavaスクリプト URLパーサのバグを修正

source: fixed housekeeper to process history_text
ja: history_textを処理するhousekeeperを修正

source: [ZBX-2246] added trigger wizard for logrt item
ja: [ZBX-2246] logrtアイテム用のトリガーウィザードを追加

source: Templated host-level screens
ja: ホストレベルのスクリーンのテンプレート化

source: fixed PostgreSQL errors with out of range string data
ja: PostgreSQL使用時に文字列データが許容範囲を超えた場合のエラーを修正

source: Thanks to Alexandr Kovalenko.
ja: Alexandr Kovalenkoに感謝

source: [ZBX-2758] fixed underlined filter label in Opera
ja: [ZBX-2758] Operaでフィルタラベルにアンダーラーンが表示される問題を修正

source: [ZBX-1454] fixed adding user to one group, removes all other users from group
ja: [ZBX-1454] ユーザをグループに追加した場合に他の全てのユーザがグループから削除される問題を修正

source: [ZBX-2147] fixed permission check for item configuration
ja: [ZBX-2147] アイテム設定の権限チェックを修正

source: [ZBX-3252] fixed graph height calculations when graph height was less then 120px
ja: [ZBX-3252] グラフの高さが120ピクセル未満の場合の高さの計算処理を修正

source: added entity counts on interfaces
ja: インターフェース上のエンティティ数を追加

source: [ZBX-901] fixed possible bug on trigger creation
ja: [ZBX-901] トリガー作成時に発生する可能性があるバグを修正

source: fixed min autologout value to 90 seconds
ja: 最小の自動ログアウトの値を90秒に修正

source: [ZBX-1202] fixed processing of proc_info[] check with 'sum' parameter.
ja: [ZBX-1202] proc_info[]チェックのパラメータ'sum'の処理を修正。

source: [ZBX-2253] fixed delete confirmation dialogue referring to empty element
ja: [ZBX-2253] 空の要素に対して削除を確認するダイアログが表示される問題を修正

source: [ZBX-2595] fixed logformat field showing
ja: [ZBX-2595] ログフォーマットフィールドの表示を修正

source: [ZBX-885] removed unused test code from Zabbix agent
ja: [ZBX-885] ZABBIXエージェントから使用していないテストコードを削除

source: Global search allows fast and easy access to hosts, templates and host groups.
ja: グローバル検索はホスト、テンプレート、ホストグループに簡単に素早くアクセスすることができます。

source: [ZBX-2245] added missing functions in trigger expression builder
ja: [ZBX-2245] トリガーの条件式作成フォームに不足していた関数を追加

source: [ZBX-3679] fixed incorrect "No nodes defined" when screen selection popup has no elements
ja: [ZBX-3679] 要素を持たないスクリーン選択ポップアップの誤った表示"No nodes defined"を修正

source: [ZBX-68] fixed iframe resize on refresh in Screens
ja: [ZBX-68] スクリーンのリフレッシュ中のiframeのリサイズを修正

source: added charset info to the email header.
ja: emailヘッダにcharset情報の追加。

source: [DEV-313] added User Group configuration window GUI improvements
ja: [DEV-313] GUIを改善しユーザグループ設定ウィンドウを追加

source: [ZBX-592] fixed incorrect {TRIGGER.STATUS} value in recovery message
ja: [ZBX-592] リカバリメッセージの間違った{TRIGGER.STATUS}値を修正

source: Try it and please let us know what you think.
ja: 利用して意見をお聞かせください。

source: Fixes and minor improvements included into 1.4.5
ja: ZABBIX 1.4.5の修正と改善

source: Fixes and minor improvements included into 1.4.6
ja: ZABBIX 1.4.6の修正と改善

source: Added caching of dynamic SNMP indexes, which makes execution of complex SNMP checks much faster.
ja: ダイナミックSNMPのキャッシュ機能を追加しました。これにより複雑なSNMPチェックの実行速度が大幅に改善されています。

source: Fixes and minor improvements included into 1.4.7
ja: ZABBIX 1.4.7の修正と改善

source: New defines ZBX_DROPDOWN_FIRST_ENTRY and ZBX_DROPDOWN_FIRST_REMEMBER in file include/defines.inc.php can be used to change what dropdown entry is selected by default and if ZABBIX front-end should remember older selection.
ja: include/defines.inc.phpファイルの新しい定義ZBX_DROPDOWN_FIRST_ENTRYとZBX_DROPDOWN_FIRST_REMEMBERによってデフォルトで選択されるドロップダウンの項目とZABBIX Webインターフェースが過去に選択した項目を記憶するかどうかを設定することができます。

source: It supports optional filtering by a selected host or a host group.
ja: ホストとホストグループの選択によるフィルタ機能が利用できます。

source: It is highly recommended to upgrade from 1.6 and 1.6.1.
ja: このリリースはZABBIX 1.6、1.6.1からアップグレードすることを強く推奨します。

source: [ZBX-2762] fixed sql error when "all" hosts is selected in application popup
ja: [ZBX-2762] アプリケーションポップアップ内で"全て"のホストが選択されている時のSQLエラーを修正

source: Fixes and minor improvements included into 1.4.4
ja: ZABBIX 1.4.4の修正と改善

source: Fixes and minor improvements included into 1.4.3
ja: ZABBIX 1.4.3の修正と改善

source: [DEV-1111] added user action confirmation
ja: [DEV-1111] ユーザの操作の承認を追加

source: [ZBX-2852] fixed map not updating in slideshow
ja: [ZBX-2852] スライドショーでマップが更新されいない問題を修正

source: [ZBX-837] removed sid from Zabbix logo link
ja: [ZBX-837] ZABBIXロゴのリンクからsidを削除

source: Better permissions on actions
ja: アクションの権限を改善

source: [ZBX-3320] fixed host.create, template.create permission error for admin users
ja: [ZBX-3320] adminユーザでAPIのhost.create、template.create呼び出し時に権限エラーになる問題を修正

source: Multiple network interfaces
ja: 複数のネットワークインターフェース

source: Time navigation bars moved to the top of the pages with hide option.
ja: タイムナビゲーションバーをページの上部に移動し、隠すオプションを追加しました。

source: It is highly recommended to upgrade from 1.6, 1.6.1 and 1.6.2.
ja: このリリースはZABBIX 1.6、1.6.1、1.6.2からアップグレードすることを強く推奨します。

source: Please wait for 1.3.5.
ja: 1.3.5までお待ちください。

source: [ZBX-2313] forbid to add graph from templates to screen
ja: [ZBX-2313] テンプレートからスクリーンへのグラフの追加を禁止

source: [ZBX-1] fixed wrong status of function "nodata" after server restart
ja: [ZBX-1] サーバリスタート後に「nodata」関数が誤ったステータスを返す問題を修正

source: [ZBX-1263] fixed misleading log messages that referenced agent for any kind of unsupported item
ja: [ZBX-1263] 未対応のアイテムに関する誤解を招く恐れのあるログメッセージを修正

source: [ZBX-1505] fixed user macros not resolved in frontend
ja: [ZBX-1505] Webインターフェースでユーザーマクロが適切に処理されない問題を修正

source: [ZBX-3854] added saving of state of dynamic/fixed setting for time lines on all pages
ja: [ZBX-3854] 全ての画面のタイムラインのdynamic/fixedの状態を保存するように修正

source: [DEV-426] added new command line parameter '-T' for zabbix_sender
ja: [DEV-426] zabbix_senderに新しいコマンドラインパラメータ「-T」を追加

source: [ZBX-1991] added sequences for autoincrement fields to oracle.sql
ja: [ZBX-1991] oracle.sqlに自動インクリメントフィールドのためのシーケンス番号生成クエリを追加

source: [ZBX-2536] fixed agent crash when processing proc.mem[] and proc.num[] on NetBSD
ja: [ZBX-2536] NetBSDのproc.mem[]やproc.num[]処理時にエージェントがクラッシュする問題を修正

source: In this case, information displayed in the element will depend on a host selected by user.
ja: この場合、要素に表示される情報はユーザによって選択されたホストに依存します。

source: [DEV-268] added support of net.if.in/out/total under AIX
ja: [DEV-268] AIX用エージェントにアイテムnet.if.in/out/totalを追加

source: [ZBX-1076] fixed IT services periods
ja: [ZBX-1076] ITサービスの期間を修正

source: [ZBX-253] fixes problem in frontend with long int values
ja: [ZBX-253] フロントエンドのlong int値の問題を修正

source: This document contains the release notes for Zabbix 1.8.6rc2.
ja: このドキュメントはZabbix 1.8.6rc2のリリースノートを含みます。

source: Several screens can be grouped into a slide show for better presentation.
ja: より見やすい表示のために、スライドショーの中に複数のスクリーンをグルーピングすることができます。

source: [ZBX-4178] fixed compilation on FreeBSD: union has no member named `sival_int'
ja: [ZBX-4178] FreeBSD上のコンパイル時の問題を修正: union has no member named `sival_int'

source: [ZBX-1035] fixed possibility to import graphs to host we don't have permissions
ja: [ZBX-1035] 権限を有していないホストにグラフをインポートできる可能性がある問題を修正

source: [ZBX-629] fixed sql error in popup window
ja: [ZBX-629] ポップアップウィンドウのSQLエラーを修正

source: fixed resetting of web graph periods
ja: Webのグラフの期間のリセットを修正

source: Thanks to Vadim Pilipenko.
ja: Vadim Pilipenkoに感謝

source: [ZBX-1822] changed in map, elements hosts now always show only count of problems
ja: [ZBX-1822] ホストのアイコンが常に現在発生している障害の数のみを表示するようにマップを変更

source: [ZBXNEXT-205,ZBXNEXT-355] added support of user macros in community, OID, security name and passphrases fields of SNMP items
ja: [ZBXNEXT-205,ZBXNEXT-355] SNMPアイテムのコミュニティ、OID、セキュリティ名、パスフレーズにユーザマクロのサポートを追加

source: fixed processing of triggers on delta items
ja: 差分データのアイテムのトリガー処理を修正

source: [ZBX-1528] fixed map permissions
ja: [ZBX-1528] マップの権限を修正

source: [ZBX-2254] added update time for monitoring triggers screen
ja: [ZBX-2254] 監視データ->トリガー画面に更新時間を追加

source: [ZBX-1329] fixed activation/deactivation of host groups
ja: [ZBX-1329] ホストグループの有効化/無効化処理をの問題を修正

source: We take the feature freeze seriously and mainly work on fixing actual bugs with few exceptions (escalations).
ja: フィーチャーフリーズ期間は一部(エスカレーション)を除き、主に現在分かっているバグの修正に取り組みます。

source: fixed problem with node syncing
ja: ノード同期の問題を修正

source: [ZBX-1648,ZBX-2300] fixed caching of "Database monitor" items.
ja: [ZBX-1648,ZBX-2300] 「データベース監視」アイテムのキャッシングの問題を修正。

source: DB2 database is supported as Zabbix back-end database.
ja: ZabbixのバックエンドデータベースとしてDB2を利用できるようになりました。

source: [ZBX-3176] removed navigation dropdown from applications screen
ja: [ZBX-3176] アプリケーション画面からナビゲーションのドロップダウンを削除

source: [1584] fixed importing/exporting of IPMI settings
ja: [1584] IPMI設定のインポートとエクスポートを修正

source: [DEV-436] improved display of ZABBIX/SNMP/IPMI agents availability information in hosts configuration screen
ja: [DEV-436] ホスト設定画面のZabbix/SNMP/IPMIエージェントの状態の表示を改善

source: [ZBX-1641] fixed handling of "Include" statement in configuration files
ja: [ZBX-1641] 設定ファイル内の"Include"設定の処理を修正

source: [ZBX-3] remove a comment saying syslog is used until it works from proxy config file as well
ja: [ZBX-3] プロキシの設定ファイルから"syslog is used until it works"というコメントを削除

source: It is strongly recommended to upgrade 1.6.6 agents to 1.6.7 if you use active checks.
ja: アクティブチェックを利用している場合、1.6.6のエージェントを1.6.7にアップグレードすることを強く推奨します。

source: [ZBX-88] changed method to GET in all forms which affect displayed info
ja: [ZBX-88] 表示される情報に影響するすべてのフォームのメソッドをGETに変更

source: [ZBX-1948] fixed node disappearing after node deleted and then created with same ID
ja: [ZBX-1948] ノード削除後に同一IDのノードを作成した場合にノードが表示されない問題を修正

source: [ZBX-935] minor fixes for snmptrap.sh.
ja: [ZBX-935] snmptrap.shの軽微な不具合を修正

source: Sending of SMS notifications via Ez Texting services
ja: Ez Textingサービスを利用したSMS通知の送信

source: improved viewing of integer items on graphs
ja: グラフ上の整数アイテムの表示を改善

source: [ZBX-3095] fixed processing of 'Host template' condition in actions
ja: [ZBX-3095] アクションのコンディション「ホストテンプレート」の処理を修正

source: [ZBX-2661] improved displaying discovery checks in configuration
ja: [ZBX-2661] 設定画面のディスカバリチェックの表示を改善

source: [ZBX-2820] fixed minor visual bugs
ja: [ZBX-2820] 表示上の細微なバグを修正

source: It should improve performance of configuration syncing very much.
ja: 設定の同期のパフォーマンスが大幅に改善されます。

source: [ZBX-2683] removed dead entries and added some translated strings for the Latvian translation
ja: [ZBX-2683] ラトビア語の翻訳ファイルからすでに利用されていないエントリを削除し、いくつかの翻訳を追加

source: [ZBX-1776] fixed js error for ie6 in triggers status screen
ja: [ZBX-1776] IE6を利用した場合のトリガーのステータス画面のjsエラーを修正

source: One template can be used for hosts having different devices.
ja: ひとつのテンプレートを、異なるデバイスが接続された複数のホストに利用することができます。

source: [ZBX-2185] added view of parent template of linked template to host
ja: [ZBX-2185] ホストにリンクされたテンプレートの親テンプレートの表示を追加

source: Please contact Salesfor pricing and more details.
ja: 価格やより詳細な情報については営業までお問い合わせください。

source: [ZBX-1860] fixed line breaks at the beginning of exported XML file
ja: [ZBX-1860] エクスポートしたXMLファイルの先頭に改行が入る問題を修正

source: [ZBX-1498] fixed error when try to create item with custom key "log" and not Log item type
ja: [ZBX-1498] タイプがログではないカスタムキー「log」アイテムを作成しようとした場合のエラーを修正

source: [ZBX-4034] fixed macros resolving in item names
ja: [ZBX-4034] アイテム名内のマクロの処理を修正

source: [ZBX-2750] fixed undefined index when deleting graph
ja: [ZBX-2750] グラフを削除時のundefined indexエラーを修正

source: This is the last call!
ja: これは最後のお願いです!

source: Information about hardware and software details can be automatically retrieved by Zabbix Agent and extended using user-defined parameters.
ja: ハードウェアとソフトウェアの詳細情報をエージェントから自動的に収集し、ユーザが定義したパラメータを利用して拡張することができます。

source: Improved icmpping* processing.
ja: icmppingの処理の改善

source: [ZBX-1564] fixed processing of performance counters which are represented as number alternatives
ja: [ZBX-1564] 数値表記のパフォーマンスカウンタの処理を修正

source: [ZBX-1638] added host name to link indicator
ja: [ZBX-1638] リンクインジケータにホスト名を追加

source: [ZBXNEXT-311] improved the speed of dbconfig synchronization
ja: [ZBXNEXT-311] dbconfigの同期速度を改善

source: [ZBX-954] fix minor typos
ja: [ZBX-954] 微細な誤字を修正

source: Pre-release testing
ja: リリース前のテスト

source: [ZBX-3274] fixed SQLite3 semaphore errors while starting server or proxy
ja: [ZBX-3274] サーバやプロキシの起動中に発生していたSQLite3セマフォエラーを修正

source: Any screen can be printed in a nice way by pressing the "Print" link.
ja: すべての画面は印刷のリンクをクリックすることにより簡単に印刷することができます。

source: [ZBX-2922] changed log level from warning to debug for some messages
ja: [ZBX-2922] いくつかのログメッセージを警告レベルからデバッグレベルに変更

source: [ZBX-981] fixed aggregate item helper text
ja: [ZBX-981] 累計アイテムのヘルプテキストを修正

source: [ZBX-847] fixed error in "Status of ZABBIX" when server is not running
ja: [ZBX-847] サーバが起動していない場合の「ZABBIXサーバのステータス」のエラーを修正

source: [ZBX-846] fixed node names instead of group names
ja: [ZBX-846] グループ名にの代わりにノード名が使用される問題を修正

source: This document contains the release notes for ZABBIX 1.6.5.
ja: このドキュメントはZABBIX 1.6.5のリリースノートを含みます。

source: It is a non-case sensitive alternative to already existing regexp().
ja: すでに存在するregexp()の大文字小文字を区別しない関数です。

source: Different algorithms of evaluation of notification conditions are supported.
ja: 通知状態の評価の異なるアルゴリズムをサポートします

source: Added transaction functionality to frontend
ja: フロントエンドの翻訳機能の追加

source: [ZBX-1961] added support of '%' prompt for telnet.run[] check
ja: [ZBX-1961] telnet.run[]チェックに「%」プロンプトのサポートを追加

source: [ZBX-1479] fixed host mass update
ja: [ZBX-1479] ホストの一括更新を修正

source: added protection against brute force login attack
ja: ブルートフォースログイン攻撃に対する防御機能を追加

source: [ZBX-1013] fixed evaluation of aggregate items for proxy hosts
ja: [ZBX-1013] プロキシホストの累計アイテムの評価を修正

source: [ZBX-2372] fixed bug with date in local language, now short and long month names shown correctly
ja: [ZBX-2372] ローカル言語における日付のバグを修正し、月名が正しく表示されるように変更

source: [ZBX-1272] server name is now shown in page title too
ja: [ZBX-1272] ページタイトルにサーバ名も表示するように修正

source: What's New in 1.1
ja: 1.1の新機能

source: fixed error 'undefined function delete_service'
ja: 「undefined function delete_service」エラーを修正

source: [ZBX-292] fixed processing of negative values in availability report
ja: [ZBX-292] 稼働レポートのマイナスの値の処理を修正

source: SQLite is an excellent choice for running zero-administration ZABBIX nodes on an embedded hardware.
ja: SQLiteは組込みハードウェアのような機器上でZABBIXを動作させる場合に適しています。

source: What's New in 1.6
ja: ZABBIX 1.6の変更点

source: [ZBX-1038] fixed last(), prev(), diff(), change(), and abschange() not working properly with long textual values
ja: [ZBX-1038] 長いテキスト文字列の場合にlast()、priv()、diff()、change()、abschange()が正しく動作しない問題を修正

source: [DEV-137] updated French translation.
ja: [DEV-137] フランス語訳を更新。

source: [ZBX-2766] fixed triggers info in status of triggers page in fullscreen mode
ja: [ZBX-2766] フルスクリーンモードでトリガーの状態画面内のトリガーの情報を修正

source: What's New in 1.4
ja: ZABBIX 1.4の変更点

source: [ZBX-2374,ZBX-2633] updated Ukrainian translation; thanks to zalex_ua
ja: [ZBX-2374,ZBX-2633] ウクライナ語訳を更新; zalex_uaに感謝

source: [ZBX-1612] fixed "API access" and "Disabled" group permissions; patch by Kodai
ja: [ZBX-1612] 「API access」と「Disabled」グループの権限を修正; Kodaiによるパッチ

source: More options for the Dashboard
ja: ダッシュボードのオプションを追加

source: [ZBX-1357] added Ukrainian translation; thanks to zalex_ua
ja: [ZBX-1357] ウクライナ語訳を追加; zalex_uaに感謝

source: [ZBX-1923] fixed processing of data sent by 1.4, 1.6 agents not allowing wrong "eventid" values
ja: [ZBX-1923] 1.4、1.6バージョンのエージェントから送付される「eventid」値のデータの処理を修正

source: What's New in 1.8
ja: Zabbix 1.8の変更点

source: [ZBX-1902] fixed some possibilities to create incorrect linkage
ja: [ZBX-1902] 間違ったリンクを作成する可能性のある問題を修正

source: Support of Quoted SNMP Strings
ja: SNMP文字列のクォートをサポート

source: [ZBX-35] fixed processing of PROFILE related macros
ja: [ZBX-35] マクロに関連するPROFILEの処理を修正

source: added JSON static buffer for better server performance
ja: サーバのパフォーマンス改善のためにJSONの固定バッファを追加

source: [ZBX-4099] fixed possible crash when processing of functions sum(), min(), max() or diff() in triggers, aggregated checks or calculated items
ja: [ZBX-4099] トリガー、累計チェック、計算アイテムでsum()、min()、max()、diff()関数の処理中にクラッシュする可能性がある問題を修正

source: Added mass-update functionality for hosts and triggers
ja: ホストとトリガーに一括更新機能を追加

source: [ZBX-2552] fixed multiple events for triggers with complicated expressions
ja: [ZBX-2552] 複雑な条件式を設定するとトリガーに複数イベントが表示される問題を修正

source: [ZBX-4036] fixed period slider position saving in Monitoring->Events
ja: [ZBX-4036] 監視データ -> イベントで期間のスライダーの状態が保存されない問題を修正

source: [ZBX-3021] fixed possibility to create dependency between host and template triggers
ja: [ZBX-3021] ホストとテンプレートのトリガーの依存関係を作成できるように修正

source: This document contains the release notes for ZABBIX 1.6.4.
ja: このドキュメントはZABBIX 1.6.4のリリースノートを含みます。

source: [ZBX-3935] fixed possible function redeclaration error
ja: [ZBX-3935] 関数の再定義エラーが発生する問題を修正

source: Nice Zoom for Graphs
ja: グラフの詳細な拡大

source: fixed processing of existing data when -n parameter is used for zabbix_server
ja: zabbix_serverで-nパラメータを使用した際の既存のデータの処理を修正

source: [ZBX-947] fixed various typos and formatting errors in changelog
ja: [ZBX-947] 変更履歴の表記間違いおよび書式エラーを修正

source: [ZBX-2697] forbid creation of maintenance without hosts\groups
ja: [ZBX-2697] ホストとグループが設定されていないメンテナンスの作成を禁止

source: [ZBX-2749] fixed length parameter being ignored for web.page.regexp[]
ja: [ZBX-2749] web.page.regexp[]のlengthパラメータが無視されていた問題を修正
